Revit 2027 API
BuiltInFailures.EditingFailures.CannotEditDeletedWorkset Property
 This action has caused deletion of non-editable Workset ' [Name] '.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotEditDeletedWorkset { get; }
Public Shared ReadOnly Property CannotEditDeletedWorkset As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotEditDeletedWorkset {
	FailureDefinitionId^ get ();
}
static member CannotEditDeletedWorkset : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace